CHT/flow-over-plate/bouyantPimpleFoam-CalculiX/Fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant OpenFOAM;

modules (CHT);

interfaces
{
  Interface1
  {
    mesh              OpenFOAM-Mesh;
    patches           (interface);
    
    readData
    (
      Heat-Flux
    );
    
    writeData
    (
      Sink-Temperature-0
    );
  };
};
